//Напишите программу вычисления функции: x = f(a)
// Возьмём ф-цию y = -2*(x*x)+4*x+2

int x = int.Parse(Console.ReadLine());
int y = -2*(x*x)+4*x+2;
Console.WriteLine(y);
