// * Напишите программу вычисления модуля числа.

int n = int.Parse(Console.ReadLine());
if (n >= 0)
{
    Console.WriteLine(n);
}
else if (n < 0)
{
    Console.WriteLine(-n);
}