// Напишите програмку, которая показывает обратное значение заданного числа
double n = double.Parse(Console.ReadLine());
double x = 1/n;
Console.WriteLine(x);